Config/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Сотрудники/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СформироватьФИО()
	
	Если НЕ ЗначениеЗаполнено(Объект.Отчество) Тогда
		Если ЗначениеЗаполнено(Объект.Имя) 
			И ЗначениеЗаполнено(Объект.Фамилия) Тогда
			Объект.Наименование = Объект.Фамилия + " " + Объект.Имя;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Имя)
			И ЗначениеЗаполнено(Объект.Фамилия) Тогда
			Объект.Наименование = Объект.Фамилия;
		Иначе 
			Объект.Наименование = Объект.Имя;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Имя) Тогда
		Если ЗначениеЗаполнено(Объект.Фамилия) 
			И ЗначениеЗаполнено(Объект.Отчество) Тогда
			Объект.Наименование = Объект.Фамилия + " " + Объект.Отчество;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Фамилия)
			И ЗначениеЗаполнено(Объект.Отчество) Тогда
			Объект.Наименование = Объект.Отчество;
		Иначе
			Объект.Наименование = Объект.Фамилия;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Фамилия)Тогда
		Если ЗначениеЗаполнено(Объект.Имя) 
			И ЗначениеЗаполнено(Объект.Отчество) Тогда
			Объект.Наименование = Объект.Имя + " " + Объект.Отчество;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Имя)
			И ЗначениеЗаполнено(Объект.Отчество) Тогда
			Объект.Наименование = Объект.Отчество;
		Иначе
			Объект.Наименование = Объект.Имя;
		КонецЕсли;
		
	Иначе
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьФИО();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры
